# RemoveLoadClassification Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..RemoveLoadClassification Method
PanelScheduleData Class See Also
---
Remove a Load Classification Id from the array of Load Classifications
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveLoadClassification(
	int nIndex
)
```

Visual Basic
---
```text
Public Sub RemoveLoadClassification ( _
	nIndex As Integer _
)
```

Visual C++
---
```text
public:
void RemoveLoadClassification(
	int nIndex
)
```

# ### Parameters
nIndex
    Type: System..::..Int32 The index at which to remove the load classification
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace